DefaultNoName/rfid-gps-esp32/ESP8266-origin.cpp
// Proof-of-Concept Project - ESP8266 Port

#include <Arduino.h>
#include <core_esp8266_features.h>
#include <ESP8266WiFi.h>
#include <ESP8266HTTPClient.h>
#include <MFRC522v2.h>
#include <MFRC522DriverSPI.h>
#include <MFRC522DriverPinSimple.h>
#include <SPI.h>
#include <SoftwareSerial.h>
#include <TinyGPSPlus.h>
#include <ArduinoJson.h>

// Wi-Fi credentials
const char *ssid = "ESP32_AP";
const char *password = "01234567890";
const char *server_ip = "192.168.120.2";
const int server_port = 80;
const char *upload_path = "/upload";
IPAddress sensor_ip(192, 168, 120, 3); // Fixed IP for sensor
IPAddress gateway(192, 168, 120, 1);   // ESP32-AP gateway
IPAddress subnet(255, 255, 255, 0);    // Subnet mask
IPAddress dns(192, 168, 120, 1);       // DNS

// Hardware pins for ESP8266 (NodeMCU/LoLin (and clones)/Wemos D1 Mini mapping)
// RFID MFRC522 pins - Standard SPI connections
#define SS_PIN 15 // D8 - GPIO15 (SS/CS pin for RFID)
#define RST_PIN 0 // D3 - GPIO0 (RST pin for RFID) or
// Note: SPI pins are fixed on ESP8266: SCK=GPIO14(D5), MOSI=GPIO13(D7), MISO=GPIO12(D6)

// GPS pins - Using SoftwareSerial library
#define GPS_RX_PIN 4 // D2 - GPIO4 (connect to GPS TX)
// #define GPS_TX_PIN 5 // D1 - GPIO5 (connect to GPS RX)

// HC-05 Bluetooth Module pins - Using SoftwareSerial
#define BT_RX_PIN 10 // S3 - GPIO 10
#define BT_TX_PIN 9  // S2 - GPIO 9

// LED indicators
#define BUILTIN_LED_PIN 2 // GPIO2 (onboard LED - active LOW on ESP8266)
#define RFID_LED_PIN 16   // D0 - GPIO16 (external LED indicator)

// System States for Pseudo-Multitasking
enum system_state_t
{
  STATE_INIT,
  STATE_WIFI_CONNECTING,
  STATE_WIFI_CONNECTED,
  STATE_BT_CONNECTING,
  STATE_BT_CONNECTED,
  STATE_HARDWARE_INIT,
  STATE_RUNNING,
  STATE_ERROR
};

// Component status tracking
struct component_status_t
{
  bool wifi_ok = false;
  bool bt_ok = false;
  bool rfid_ok = false;
  bool gps_ok = false;
  bool http_ok = false;
  String last_error = "";
};

// Timing structure to handle GPS time availability
struct timing_data_t
{
  unsigned long millis_timestamp;     // Always available - system reference
  String gps_time_string;             // GPS time if available
  bool gps_time_valid;                // Whether GPS time was available at capture
  unsigned long gps_reference_millis; // millis() when GPS became available
  String calculated_time;             // Final calculated time (GPS or estimated)
};

// Global variables
system_state_t current_system_state = STATE_INIT;
component_status_t components;
WiFiClient client;
HTTPClient http;

// Global timing variables
timing_data_t exit_timing;
timing_data_t entry_timing;
unsigned long gps_became_available_at = 0; // When GPS first became valid
bool gps_ever_available = false;

// Hardware variables - Fixed pin assignments
MFRC522DriverPinSimple ss_pin(SS_PIN);
MFRC522DriverSPI driver{ss_pin};
MFRC522 module_rfid{driver};
TinyGPSPlus module_gps;
SoftwareSerial serial_gps(GPS_RX_PIN, -1);

// Timing variables
unsigned long last_wifi_attempt = 0;
unsigned long last_rfid_read = 0;
unsigned long last_gps_update = 0;
unsigned long last_http_send = 0;
unsigned long last_health_check = 0;
unsigned long state_timeout = 0;

// Vehicle constants
const char *vehicle_brand = "Toyota";
const char *vehicle_model = "Tamaraw FX";
const char *vehicle_plate = "UAM981";

// Data storage
String current_rfid = "N/A";
String time_exit = "N/A";
String time_entry = "N/A";
String trip_duration = "N/A";
String current_gps_time = "N/A";
String current_gps_lat = "N/A";
String current_gps_lng = "N/A";
String current_gps_alt = "N/A";
String current_gps_speed = "N/A";
String current_gps_sats = "N/A";
String current_gps_hdop = "N/A";

// Fixed MAC address retrieval for ESP8266
String get_phys_addr()
{
  String mac = WiFi.macAddress();
  mac.replace(":", ""); // Remove colons to match format
  return mac;
}
String phys_addr_str = "";       // Will be set in setup()
const char *phys_addr = nullptr; // Will be set in setup()

// State machine functions
void handle_init_state()
{
  Serial.println("=== System Initialization ===");
  Serial.printf("Free heap: %d bytes\n", ESP.getFreeHeap());

  // ESP8266 has less RAM - adjust threshold accordingly
  if (ESP.getFreeHeap() < 10000)
  {
    Serial.println("Insufficient memory available, restarting...");
    delay(1000);
    ESP.restart();
  }

  // Initialize serial communication for GPS @ 9600 baud
  serial_gps.begin(9600);

  // Move to WiFi connection state
  current_system_state = STATE_WIFI_CONNECTING;
  last_wifi_attempt = millis();
  state_timeout = millis() + 30000; // 30 second timeout
  Serial.println("Moving to WiFi connection state");
}

void handle_wifi_connecting()
{
  static bool wifi_started = false;
  static int wifi_attempts = 0;

  if (!wifi_started)
  {
    Serial.println("Starting WiFi Connection...");
    WiFi.mode(WIFI_STA);
    WiFi.setAutoReconnect(false); // We'll handle reconnection manually
    WiFi.setSleepMode(WIFI_NONE_SLEEP);
    WiFi.config(sensor_ip, gateway, subnet, dns);
    WiFi.begin(ssid, password);
    wifi_started = true;
    Serial.print("Connecting");
    return;
  }

  // Check WiFi status every 500ms
  if (millis() - last_wifi_attempt > 500)
  {
    wl_status_t status = WiFi.status();

    if (status == WL_CONNECTED)
    {
      Serial.println();
      Serial.printf("WiFi Connected! IP: %s, Signal: %d dBm\n",
                    WiFi.localIP().toString().c_str(), WiFi.RSSI());
      components.wifi_ok = true;
      current_system_state = STATE_WIFI_CONNECTED;
      return;
    }

    if (status == WL_CONNECT_FAILED || status == WL_NO_SSID_AVAIL || status == WL_WRONG_PASSWORD)
    {
      Serial.printf("\nWiFi Connection Failed with Status: %d\n", status);
      components.last_error = "Can't connect to WiFi network, check WiFi config.";
      current_system_state = STATE_ERROR;
      return;
    }

