DefaultNoName/rfid-gps-esp32/ESP8266-origin.cpp
    Serial.print(".");
    last_wifi_attempt = millis();
    wifi_attempts++;

    // Timeout check
    if (millis() > state_timeout)
    {
      Serial.println("\nWiFi connection timeout");
      components.last_error = "WiFi connection timeout.";
      current_system_state = STATE_ERROR;
      return;
    }
  }
}

void handle_wifi_connected()
{
  Serial.println("Initializing hardware...");
  current_system_state = STATE_HARDWARE_INIT;
  state_timeout = millis() + 10000; // 10 second timeout for hardware initialize
}

void handle_hardware_init()
{
  static bool spi_initialized = false;
  static bool rfid_tested = false;
  static bool gps_tested = false;

  // Initialize SPI once
  if (!spi_initialized)
  {
    Serial.println("Initializing SPI...");
    SPI.begin();
    delay(100);
    spi_initialized = true;
    Serial.printf("SPI initialized. Free heap: %d\n", ESP.getFreeHeap());
    return;
  }

  // Test RFID
  if (!rfid_tested)
  {
    Serial.println("Testing RFID module...");

    // Simple test - Initialize without complex operations
    try
    {
      module_rfid.PCD_Init();
      delay(100);
      byte version = module_rfid.PCD_GetVersion();

      if (version != 0x00 && version != 0xFF)
      {
        Serial.printf("RFID OK - Version: 0x%02X\n", version);
        components.rfid_ok = true;
      }
      else
      {
        Serial.println("RFID not detected, continuing without it");
        components.rfid_ok = false;
      }
    }
    catch (...)
    {
      Serial.println("RFID initialization caused exception, now disabled.");
      components.rfid_ok = false;
    }

    rfid_tested = true;
    Serial.printf("After RFID test. Free heap: %d\n", ESP.getFreeHeap());
    return;
  }

  // Test GPS - just check if data is available
  if (!gps_tested)
  {
    Serial.println("Testing GPS module...");

    unsigned long start_time = millis();
    bool gps_data_seen = false;

    // Quick test - just look for any data for 2 seconds
    while (millis() - start_time < 2000)
    {
      if (serial_gps.available())
      {
        serial_gps.read(); // Just consume the data
        gps_data_seen = true;
        break;
      }
      delay(10);
    }

    if (gps_data_seen)
    {
      Serial.println("GPS data detected");
      components.gps_ok = true;
    }
    else
    {
      Serial.println("No GPS data, continuing without it");
      components.gps_ok = false;
    }

    gps_tested = true;
    Serial.printf("After GPS test. Free heap: %d\n", ESP.getFreeHeap());
    return;
  }

  // All hardware tests complete
  Serial.println("Hardware initialization complete");
  Serial.printf("Status: WiFi=%s, RFID=%s, GPS=%s\n",
                components.wifi_ok ? "OK" : "FAIL",
                components.rfid_ok ? "OK" : "FAIL",
                components.gps_ok ? "OK" : "FAIL");

  components.http_ok = true; // HTTP is always available if WiFi works
  current_system_state = STATE_RUNNING;
}

void handle_error_state()
{
  Serial.printf("System Error: %s\n", components.last_error.c_str());
  Serial.println("Will restart in 5 seconds...");
  delay(5000);
  ESP.restart();
}

// Helper function to convert GPS time to local time string (GMT+8)
String format_gps_time_to_local(TinyGPSTime &gps_time)
{
  if (gps_time.isValid() == false)
  {
    return "N/A";
  }

  // Convert to total seconds since midnight UTC
  uint32_t utc_in_seconds = gps_time.hour() * 3600 + gps_time.minute() * 60 + gps_time.second();

  // Add 8 hours for GMT+8 timezone
  uint32_t local_seconds = (utc_in_seconds + 28800) % 86400; // 86400 = seconds in a day

  // Convert back to hours, minutes, seconds
  uint8_t hours = local_seconds / 3600;
  uint8_t minutes = (local_seconds % 3600) / 60;
  uint8_t seconds = local_seconds % 60;

  // Format as HH:MM:SS string
  char time_str[12]; // "HH:MM:SS" + null terminator
  snprintf(time_str, sizeof(time_str), "%02d:%02d:%02d", hours, minutes, seconds);

  return String(time_str);
}

// Handle GPS reading
void handle_gps_reading()
{
  static unsigned long GPS_UPDATE_INTERVAL = 1000;
  static unsigned long lastGPSUpdate = 0;

  while (serial_gps.available())
  {
    if (module_gps.encode(serial_gps.read()))
    {
      unsigned long currentTime = millis();
      if (currentTime - lastGPSUpdate >= GPS_UPDATE_INTERVAL)
      { // Update time if valid
        if (module_gps.time.isValid())
        {
          current_gps_time = format_gps_time_to_local(module_gps.time);
        }

        // Update location if valid
        if (module_gps.location.isValid())
        {
          current_gps_lat = String(module_gps.location.lat(), 8);
          current_gps_lng = String(module_gps.location.lng(), 8);
          Serial.println(current_gps_lat);
          Serial.println(current_gps_lng);
        }

        // Update other GPS data
        current_gps_alt = module_gps.altitude.isValid() ? String(module_gps.altitude.meters(), 4) : "N/A";
        current_gps_speed = module_gps.speed.isValid() ? String(module_gps.speed.kmph(), 4) : "N/A";
        current_gps_sats = module_gps.satellites.isValid() ? String(module_gps.satellites.value()) : "N/A";
        current_gps_hdop = module_gps.hdop.isValid() ? String(module_gps.hdop.hdop(), 4) : "N/A";
        lastGPSUpdate = currentTime;
      }
    }
  }
}

// Helper function to calculate trip duration
void calculate_trip_duration(uint32_t start_time_millis)
{
  unsigned long duration_ms = millis() - start_time_millis;

  uint16_t hours = duration_ms / 3600000;
  uint16_t minutes = (duration_ms % 3600000) / 60000;
  uint16_t seconds = (duration_ms % 60000) / 1000;

  char duration_str[12];
  snprintf(duration_str, sizeof(duration_str), "%02d:%02d:%02d", hours, minutes, seconds);
  trip_duration = String(duration_str);

  Serial.println("TRIP DURATION: " + trip_duration);
}
// Helper function to capture current time with GPS fallback
timing_data_t capture_current_time()
{
  timing_data_t timing;

  // Always capture millis timestamp as reference
  timing.millis_timestamp = millis();

