DefaultNoName/rfid-gps-esp32/ESP8266-origin.cpp
  // Check if GPS time is currently available
  if (module_gps.time.isValid())
  {
    // GPS is available - use it directly
    timing.gps_time_string = format_gps_time_to_local(module_gps.time);
    timing.gps_time_valid = true;
    timing.calculated_time = timing.gps_time_string;

    // Track when GPS became available for the first time
    if (!gps_ever_available)
    {
      gps_became_available_at = timing.millis_timestamp;
      gps_ever_available = true;
      Serial.println("GPS became available at millis: " + String(gps_became_available_at));
    }

    timing.gps_reference_millis = gps_became_available_at;
  }
  else
  {
    // GPS not available - we'll calculate later if it becomes available
    timing.gps_time_string = "N/A";
    timing.gps_time_valid = false;
    timing.calculated_time = "Wait for GPS fix";
    timing.gps_reference_millis = 0;
  }

  return timing;
}

// Helper function to calculate time from millis offset when GPS becomes available
String calculate_time_from_offset(unsigned long target_millis, unsigned long gps_reference_millis,
                                  const String &gps_reference_time)
{
  if (gps_reference_time == "N/A" || gps_reference_millis == 0)
  {
    return "N/A";
  }

  // Calculate the time difference in milliseconds
  long time_diff_ms = target_millis - gps_reference_millis;

  // Parse the GPS reference time to get seconds since midnight
  int hours, minutes, seconds;
  if (sscanf(gps_reference_time.c_str(), "%d:%d:%d", &hours, &minutes, &seconds) != 3)
  {
    return "N/A";
  }

  // Convert to total seconds since midnight
  long total_seconds = hours * 3600 + minutes * 60 + seconds;

  // Add the offset (convert ms to seconds)
  total_seconds += time_diff_ms / 1000;

  // Handle day overflow/underflow
  if (total_seconds >= 86400)
  {
    total_seconds %= 86400; // Wrap to next day
  }
  else if (total_seconds < 0)
  {
    total_seconds = 86400 + (total_seconds % 86400); // Wrap to previous day
  }

  // Convert back to hours, minutes, seconds
  int calc_hours = total_seconds / 3600;
  int calc_minutes = (total_seconds % 3600) / 60;
  int calc_seconds = total_seconds % 60;

  // Format as time string
  char time_str[12];
  snprintf(time_str, sizeof(time_str), "%02d:%02d:%02d", calc_hours, calc_minutes, calc_seconds);

  return String(time_str);
}

// Helper function to update pending timestamps when GPS becomes available
void update_pending_timestamps()
{
  if (!gps_ever_available)
  {
    return; // GPS still not available
  }

  // Get current GPS time as reference
  String current_gps_time = format_gps_time_to_local(module_gps.time);

  // Update exit time if it was pending
  if (exit_timing.calculated_time == "Wait for GPS fix")
  {
    exit_timing.calculated_time = calculate_time_from_offset(
        exit_timing.millis_timestamp,
        gps_became_available_at,
        current_gps_time);
    Serial.println("Updated exit time: " + exit_timing.calculated_time);
  }

  // Update entry time if it was pending
  if (entry_timing.calculated_time == "Wait for GPS fix")
  {
    entry_timing.calculated_time = calculate_time_from_offset(
        entry_timing.millis_timestamp,
        gps_became_available_at,
        current_gps_time);
    Serial.println("Updated entry time: " + entry_timing.calculated_time);
  }
}

// Modified helper function to handle exit scan
void handle_exit_scan(const String &new_scanned_uid, String &last_new_scanned_uid, bool &is_on_travel,
                      unsigned long &last_valid_read, unsigned long &start_time_millis)
{
  last_new_scanned_uid = new_scanned_uid;
  current_rfid = new_scanned_uid;
  last_valid_read = millis();
  is_on_travel = true;

  Serial.println("Internal millis() Timer started");
  start_time_millis = millis();

  // Capture exit timing with GPS fallback
  exit_timing = capture_current_time();
  time_exit = exit_timing.calculated_time;

  Serial.println("EXIT TIME @ " + time_exit + " - UID: " + new_scanned_uid);

  if (exit_timing.gps_time_valid)
  {
    Serial.println("Exit time captured with GPS");
  }
  else
  {
    Serial.println("Exit time pending GPS availability");
  }
}

// Modified helper function to handle entry scan
void handle_entry_scan(const String &new_scanned_uid, String &last_new_scanned_uid, bool &is_on_travel,
                       unsigned long &last_valid_read, unsigned long start_time_millis)
{
  last_valid_read = millis();
  last_new_scanned_uid = "";
  is_on_travel = false;

  // Capture entry timing with GPS fallback
  entry_timing = capture_current_time();
  time_entry = entry_timing.calculated_time;

  Serial.println("ENTRY TIME @ " + time_entry + " - UID: " + new_scanned_uid);

  if (entry_timing.gps_time_valid)
  {
    Serial.println("Entry time captured with GPS");
  }
  else
  {
    Serial.println("Entry time pending GPS availability");
  }

  // Calculate duration using millis timestamps for accuracy
  calculate_trip_duration(start_time_millis);
}

// Helper function to clean up RFID module and LEDs
void cleanup_rfid()
{
  module_rfid.PICC_HaltA();
  module_rfid.PCD_StopCrypto1();

  delay(1000);
  digitalWrite(BUILTIN_LED_PIN, HIGH); // Turn off LED (active LOW)
  digitalWrite(RFID_LED_PIN, LOW);     // Turn off external LED
}

// Enhanced RFID reading function
void handle_rfid_reading()
{
  static String last_new_scanned_uid = "";
  static bool is_on_travel = false;
  static unsigned long last_valid_read = 0;
  static unsigned long start_time_millis = 0;

  // Check if GPS became available and update pending timestamps
  if (module_gps.time.isValid())
  {
    update_pending_timestamps();

    // Update current GPS time for transmission
    current_gps_time = format_gps_time_to_local(module_gps.time);

    // Update the transmitted times if they were pending
    if (time_exit == "Wait for GPS fix")
    {
      time_exit = exit_timing.calculated_time;
    }
    if (time_entry == "Wait for GPS fix")
    {
      time_entry = entry_timing.calculated_time;
    }
  }

