DefaultNoName/rfid-gps-esp32/ESP8266-origin.cpp
  // Original RFID reading logic
  if (!module_rfid.PICC_IsNewCardPresent() || !module_rfid.PICC_ReadCardSerial())
  {
    return;
  }

  // Turn on LED indicators
  digitalWrite(BUILTIN_LED_PIN, LOW); // Active LOW
  digitalWrite(RFID_LED_PIN, HIGH);

  // Read UID
  String new_scanned_uid = "";
  for (byte i = 0; i < module_rfid.uid.size; i++)
  {
    if (module_rfid.uid.uidByte[i] < 0x10)
    {
      new_scanned_uid += "0";
    }
    new_scanned_uid += String(module_rfid.uid.uidByte[i], HEX);
  }
  new_scanned_uid.toUpperCase();

  // Debouncing - ignore rapid repeated scans
  if ((millis() - last_valid_read) < 30000) // Ignore for 30 seconds
  {
    cleanup_rfid();
    return;
  }

  // Handle different scan scenarios
  if (last_new_scanned_uid == "" || !is_on_travel)
  {
    // First scan or returning from travel - this is EXIT
    handle_exit_scan(new_scanned_uid, last_new_scanned_uid, is_on_travel,
                     last_valid_read, start_time_millis);
  }
  else if (new_scanned_uid == last_new_scanned_uid && is_on_travel)
  {
    // Same card scanned while out - this is ENTRY
    handle_entry_scan(new_scanned_uid, last_new_scanned_uid, is_on_travel,
                      last_valid_read, start_time_millis);
  }
  else if (new_scanned_uid != last_new_scanned_uid && is_on_travel)
  {
    // Different card while authorized person is out - UNAUTHORIZED
    Serial.println("UNAUTHORIZED - Wrong RFID Card. Expected: " +
                   last_new_scanned_uid + ", Got: " + new_scanned_uid);
    last_valid_read = millis();
  }

  cleanup_rfid();
}

void handle_http_transmission()
{
  JsonDocument doc;
  doc["phys_addr"] = phys_addr;
  doc["brand"] = vehicle_brand;
  doc["model"] = vehicle_model;
  doc["pltNum"] = vehicle_plate;
  doc["uid"] = current_rfid;
  doc["time_EXIT"] = time_exit;
  doc["time_ENTRY"] = time_entry;
  doc["trip_duration"] = trip_duration;
  doc["GPS_time"] = current_gps_time;
  doc["lat"] = current_gps_lat;
  doc["long"] = current_gps_lng;
  doc["alt"] = current_gps_alt;
  doc["spd"] = current_gps_speed;
  doc["sat"] = current_gps_sats;
  doc["hdop"] = current_gps_hdop;

  String json;
  serializeJson(doc, json);

  String url = String("http://") + server_ip + ":" + String(server_port) + upload_path;

  http.begin(client, url); // ESP8266HTTPClient syntax
  http.addHeader("Content-Type", "application/json");
  http.setTimeout(15000);

  int http_response_code = http.POST(json);
  if (http_response_code == 200)
  {
    // Success - no need to log every successful transmission
  }
  else if (http_response_code > 0)
  {
    Serial.printf("HTTP Error %d\n", http_response_code);
  }
  else
  {
    Serial.printf("HTTP Connection Error: %d\n", http_response_code);
  }

  http.end();
}

void handle_health_check()
{
  Serial.printf("Health: Heap=%d, WiFi=%s (%ddBm), RFID=%s, GPS=%s, HTTP=%s\n",
                ESP.getFreeHeap(),
                components.wifi_ok ? "OK" : "FAIL",
                WiFi.RSSI(),
                components.rfid_ok ? "OK" : "FAIL",
                components.gps_ok ? "OK" : "FAIL",
                components.http_ok ? "OK" : "FAIL");

  // ESP8266 memory check - lower threshold
  if (ESP.getFreeHeap() < 8000)
  {
    Serial.println("WARNING: Low memory, restarting system");
    delay(1000);
    ESP.restart();
  }
}

void handle_running_state()
{
  unsigned long current_time = millis();

  // Check WiFi status
  if (WiFi.status() != WL_CONNECTED && WiFi.status() == WL_DISCONNECTED)
  {
    Serial.println("WiFi disconnected, returning to connection state");
    components.wifi_ok = false;
    components.http_ok = false;
    current_system_state = STATE_WIFI_CONNECTING;
    last_wifi_attempt = 0;
    state_timeout = millis() + 30000;
    return;
  }

  // Handle RFID reading
  if (components.rfid_ok && current_time - last_rfid_read > 100)
  {
    handle_rfid_reading();
    last_rfid_read = current_time;
  }

  // Handle GPS reading
  if (components.gps_ok && current_time - last_gps_update > 500)
  {
    handle_gps_reading();
    last_gps_update = current_time;
  }

  // Handle HTTP transmission
  if (components.http_ok && current_time - last_http_send > 5000)
  {
    handle_http_transmission();
    last_http_send = current_time;
  }

  // Health check
  if (current_time - last_health_check > 15000)
  {
    handle_health_check();
    last_health_check = current_time;
  }
}

void setup()
{
  Serial.begin(9600);
  delay(1000);
  system_update_cpu_freq(160); // 160MHz for ESP8266
  delay(1000);

  // Initialize LED pins
  pinMode(BUILTIN_LED_PIN, OUTPUT);
  pinMode(RFID_LED_PIN, OUTPUT);
  digitalWrite(BUILTIN_LED_PIN, HIGH); // Turn off builtin LED (active LOW)
  digitalWrite(RFID_LED_PIN, LOW);     // Turn off external LED

  // Ensure WiFi is started before getting MAC address
  WiFi.mode(WIFI_STA);
  WiFi.begin(ssid, password);
  delay(100); // Give WiFi stack time to initialize
  phys_addr_str = get_phys_addr();
  phys_addr = phys_addr_str.c_str(); // ESP8266's MAC Address

  Serial.println("=== ESP8266 RFID-GPS System ===");
  Serial.println("Device UUID: " + phys_addr_str);

  // Start with initialization state
  current_system_state = STATE_INIT;
}

void loop()
{
  // State Machine Execution
  switch (current_system_state)
  {
  case STATE_INIT:
    handle_init_state();
    break;
  case STATE_WIFI_CONNECTING:
    handle_wifi_connecting();
    break;
  case STATE_WIFI_CONNECTED:
    handle_wifi_connected();
    break;
  case STATE_HARDWARE_INIT:
    handle_hardware_init();
    break;
  case STATE_RUNNING:
    handle_running_state();
    break;
  case STATE_ERROR:
    handle_error_state();
    break;
  }
  // Small delay to prevent watchdog issues
  delay(10);
}
